package searchengine;

import org.apache.lucene.morphology.LuceneMorphology;
import org.apache.lucene.morphology.russian.RussianLuceneMorphology;
import searchengine.services.LemmaService.LemmaServiceImpl;


import java.io.IOException;

public class TestLemma {
    /*public static void main(String[] args) throws IOException {
        String text = "Повторное появление леопарда в Осетии позволяет предположить, что леопард постоянно обитает в некоторых районах Северного Кавказа.";

        LuceneMorphology luceneMorphology = new RussianLuceneMorphology();
        LemmaServiceImpl lemmaService = new LemmaServiceImpl(luceneMorphology);

        System.out.println(lemmaService.collectLemmas("Варламов увидел цены на яйца в магазине русских эмигрантов и удивился: Интернет: Интернет и СМИ: Lenta.ru Главное Россия Мир Бывший СССР Экономика Силовые структуры Наука и техника Культура Спорт Интернет и СМИ Ценности Путешествия Из жизни Среда обитания Забота о себе Победа Войти Эксклюзивы Статьи Галереи Видео Спецпроекты Мини-игры Мотор Архив Лента добра Хочешь видеть только хорошие новости? Жми! Вернуться в обычную ленту? Войти Интернет и СМИ ВсеИнтернетКиберпреступностьCoцсетиМемыРекламаПрессаТВ и радиоФактчекинг 15:20, 26 июня 2025Интернет и СМИ Варламов увидел цены на яйца в магазине русских эмигрантов и удивился Варламов удивился яйцам за четыре доллара в русском магазине в Аргентине Олег Давыдов (Редактор отдела «Интернет и СМИ») Фото: Unsplash Популярный российский блогер Илья Варламов (внесен Минюстом в реестр иноагентов) побывал в Аргентине и удивился ценам на куриные яйца в магазине. Видео о поездке опубликовано на YouTube. Блогер посетил магазин органических продуктов, которым владеют эмигранты из России. Шесть куриных яиц там стоили четыре доллара (около 300 рублей). «Вы вообще с ума сошли?» — отреагировал Варламов, узнав цену, и уточнил, что одно куриное яйцо в этом магазине стоит около 70 рублей. Ранее блогер рассказал о ценах на яйца в Нью-Йорке. Там дюжина яиц стоила от 10 до 13 долларов (примерно от 800 до 1000 рублей). Перед этим Варламов также назвал абсолютно неадекватными цены на блюда в ресторанах Нью-Йорка. По словам блогера, из-за этого ему трудно получать удовольствие от еды в этом городе. Что думаешь? Оцени! Обсудить Последние новости Песков раскрыл детали разговора Путина и Трампа о Европе 15:46 Стало известно о возможной подготовке нового обмена пленными между Россией и Украиной 15:49 Премьер-министр Украины поручил распределить РЭБ в прифронтовые регионы 15:48 Бросивший ребенка об пол в российском аэропорту мужчина отреагировал на обвинение 15:47 Продажи китайских машин с пробегом в России взлетели 15:46 В одной стране назвали пошлины Трампа вдвойне несправедливыми 15:45 Участник СВО оплатил новую детскую площадку в родном селе 15:44 Раскрыта удивительная польза шпината и капусты 15:41 Россияне назвали страну мечты для путешествия 15:40 Северная Корея направит дополнительные войска в зону СВО 15:37 Все новости РедакцияРекламаКонтактыПресс-релизыТехподдержкаСпецпроектыВакансииRSSУсловия использованияПолитика конфиденциальностиПравила применения рекомендательных технологийМини-игры © 1999–2025 ООО «Лента.Ру» Нашли опечатку? Нажмите Ctrl+Enter 18+ Лента добра деактивирована. Добро пожаловать в реальный мир. Новые материалы Все новости"));


    }*/
}